# AverageEstimatedIllumination Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..AverageEstimatedIllumination Property
Space Class See Also
---
Get the Average Estimated Illumination of the Space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double AverageEstimatedIllumination { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AverageEstimatedIllumination As Double
	Get
```

Visual C++
---
```text
public:
property double AverageEstimatedIllumination {
	double get ();
}
```

# Remarks
This property is used to get the Average Estimated Illumination of the Space. (Unit: fc)
# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace